Gets all possible fabrication part custom data identifiers.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public IList<int> GetAllPartCustomData()
  Visual Basic
Public Function GetAllPartCustomData As IList(Of Integer)
  Visual C++
public:
IList<int>^ GetAllPartCustomData()
 Return Value
 an array of custom data identifiers.
 See Also
  FabricationConfiguration Class
  Autodesk.Revit.DB Namespace